X = int(input())

# 점화식: a_i = min(a_{i-1}, a_{i/2}, a_{i/3}, a_{i/5}) + 1

d = [0] * 30001

for i in range(2, X + 1):
    # 현재의 수에서 1을 빼는 경우
    d[i] = d[i-1] + 1
    # 현재의 수가 2로 나누어 떨어지는 경우
    if i % 2 == 0:
        d[i] = min(d[i], d[i // 2] + 1)
    # 현재의 수가 3으로 나누어 떨어지는 경우
    if i % 3 == 0:
        d[i] = min(d[i], d[i // 3] + 1)
    # 현재의 수가 5로 나누어 떨어지는 경우
    if i % 5 == 0:
        d[i] = min(d[i], d[i // 5] + 1)
print(d[X])

# 모든 연산은 1을 빼는 연산이 가능하므로 1을 우선적으로 뺀 후, 2,3,5로 각각 나누어 떨어지는 경우를 확인하여 
# 최소 연산 횟수를 갱산하는 방식으로 점화식을 구성